Ran Plan for project: `vntechies-gitops` dir: `terraform/ap-southeast-1` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.eks.data.aws_region.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_caller_identity.current: Reading...
module.vpc["demo-vpc"].data.aws_region.current: Reading...
module.eks.data.aws_region.current: Read complete after 0s [id=ap-southeast-1]
module.vpc["demo-vpc"].data.aws_region.current: Read complete after 0s [id=ap-southeast-1]
data.aws_eks_cluster_auth.eks: Reading...
data.aws_eks_cluster_auth.eks: Read complete after 0s [id=thodung-vntechies-eks-demo-eks]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=010352592457]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "eks" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "thodung-vntechies-eks-demo-eks"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_subnets.eks_vpc_subnets will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnets" "eks_vpc_subnets" {
      + id   = (known after apply)
      + ids  = (known after apply)
      + tags = (known after apply)

      + filter {
          + name   = "vpc-id"
          + values = [
              + (known after apply),
            ]
        }
    }

  # module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "aws-ebs-csi-driver"
      + id                 = (known after apply)
      + kubernetes_version = "1.25"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.25"
      + version            = (known after apply)
    }

  # module.eks.data.tls_certificate.this will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be created
+ resource "aws_eks_addon" "this" {
      + addon_name               = "aws-ebs-csi-driver"
      + addon_version            = (known after apply)
      + arn                      = (known after apply)
      + cluster_name             = "thodung-vntechies-eks-demo-eks"
      + configuration_values     = (known after apply)
      + created_at               = (known after apply)
      + id                       = (known after apply)
      + modified_at              = (known after apply)
      + resolve_conflicts        = "OVERWRITE"
      + service_account_role_arn = (known after apply)
      + tags_all                 = {
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
    }

  # module.eks.aws_eks_addon.this["cni"] will be created
+ resource "aws_eks_addon" "this" {
      + addon_name               = "vpc-cni"
      + addon_version            = (known after apply)
      + arn                      = (known after apply)
      + cluster_name             = "thodung-vntechies-eks-demo-eks"
      + configuration_values     = (known after apply)
      + created_at               = (known after apply)
      + id                       = (known after apply)
      + modified_at              = (known after apply)
      + resolve_conflicts        = "OVERWRITE"
      + service_account_role_arn = (known after apply)
      + tags_all                 = {
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
    }

  # module.eks.aws_eks_cluster.eks will be created
+ resource "aws_eks_cluster" "eks" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "thodung-vntechies-eks-demo-eks"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags_all              = {
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + version               = "1.25"

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.node["workers-1-23"] will be created
+ resource "aws_eks_node_group" "node" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "thodung-vntechies-eks-demo-eks"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3a.medium",
        ]
      + node_group_name        = "workers-1-23"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = {
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + version                = "1.25"

      + scaling_config {
          + desired_size = 3
          + max_size     = 5
          + min_size     = 3
        }

      + update_config {
          + max_unavailable_percentage = 40
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
+ resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = {
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_policy.ebs_csi["aws-ebs-csi-driver"] will be created
+ resource "aws_iam_policy" "ebs_csi" {
      + arn         = (known after apply)
      + description = "Custom Manged Policy for IRSA for the Kubernetes service account ebscsi-controller-sa."
      + id          = (known after apply)
      + name        = "thodung-vntechies-demo-eks-ebs-csi"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:CreateSnapshot",
                          + "ec2:AttachVolume",
                          + "ec2:DetachVolume",
                          + "ec2:ModifyVolume",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeSnapshots",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeVolumesModifications",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "ec2:CreateAction" = [
                                  + "CreateVolume",
                                  + "CreateSnapshot",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ec2:DeleteTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/CSIVolumeName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/CSIVolumeName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/kubernetes.io/created-for/pvc/name" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteSnapshot",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/CSIVolumeSnapshotName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteSnapshot",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
    }

  # module.eks.aws_iam_role.cluster will be created
+ resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-cluster-thodung-vntechies-demo-eks"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.irsa["aws-ebs-csi-driver"] will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "AWS IAM Role for the Kubernetes service account ebscsi-controller-sa."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aws-ebs-csi-driver"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.node will be created
+ resource "aws_iam_role" "node" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-node-group-thodung-vntechies-demo-eks"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly will be created
+ resource "aws_iam_role_policy_attachment" "AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-node-group-thodung-vntechies-demo-eks"
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy will be created
+ resource "aws_iam_role_policy_attachment" "AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-cluster-thodung-vntechies-demo-eks"
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController will be created
+ resource "aws_iam_role_policy_attachment" "AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "eks-cluster-thodung-vntechies-demo-eks"
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy will be created
+ resource "aws_iam_role_policy_attachment" "AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-node-group-thodung-vntechies-demo-eks"
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy will be created
+ resource "aws_iam_role_policy_attachment" "AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-node-group-thodung-vntechies-demo-eks"
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonSSMManagedInstanceCore will be created
+ resource "aws_iam_role_policy_attachment" "AmazonSSMManagedInstanceCore" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "eks-node-group-thodung-vntechies-demo-eks"
    }

  # module.eks.aws_iam_role_policy_attachment.irsa_ebs_csi_policy["aws-ebs-csi-driver"] will be created
+ resource "aws_iam_role_policy_attachment" "irsa_ebs_csi_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "aws-ebs-csi-driver"
    }

  # module.eks.kubernetes_config_map_v1_data.aws_auth[0] will be created
+ resource "kubernetes_config_map_v1_data" "aws_auth" {
      + data          = (known after apply)
      + field_manager = "Terraform"
      + force         = true
      + id            = (known after apply)

      + metadata {
          + name      = "aws-auth"
          + namespace = "kube-system"
        }
    }

  # module.vpc["demo-vpc"].aws_internet_gateway.igw[0] will be created
+ resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "thodung-vntechies-igw-demo-vpc"
        }
      + tags_all = {
          + "Name"        = "thodung-vntechies-igw-demo-vpc"
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_route.public_internet_gateway[0] will be created
+ resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc["demo-vpc"].aws_route_table.this["public_rtb"] will be created
+ resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "thodung-vntechies-rtb-demo-vpc-public-rtb"
        }
      + tags_all         = {
          + "Name"        = "thodung-vntechies-rtb-demo-vpc-public-rtb"
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + vpc_id           = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc["demo-vpc"].aws_route_table_association.this["public_subnet1"] will be created
+ resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_route_table_association.this["public_subnet2"] will be created
+ resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_route_table_association.this["public_subnet3"] will be created
+ resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_security_group.endpoint will be created
+ resource "aws_security_group" "endpoint" {
      + arn                    = (known after apply)
      + description            = "Allow ECR inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "thodung-vntechies-sg-vpce-ap-southeast-1"
        }
      + tags_all               = {
          + "Name"        = "thodung-vntechies-sg-vpce-ap-southeast-1"
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_subnet.this["public_subnet1"] will be created
+ resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "thodung-vntechies-public_subnet1-ap-southeast-1a"
          + "group"                  = "public_subnet"
          + "kubernetes.io/role/elb" = "1"
          + "public_subnet1"         = "ap-southeast-1a"
        }
      + tags_all                                       = {
          + "Name"                   = "thodung-vntechies-public_subnet1-ap-southeast-1a"
          + "component"              = "thodung"
          + "env"                    = "vntechies"
          + "github_repo"            = "github.com/vntechies/013-demo-gitops"
          + "group"                  = "public_subnet"
          + "kubernetes.io/role/elb" = "1"
          + "project"                = "013-demo-gitops"
          + "public_subnet1"         = "ap-southeast-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_subnet.this["public_subnet2"] will be created
+ resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "thodung-vntechies-public_subnet2-ap-southeast-1b"
          + "group"                  = "public_subnet"
          + "kubernetes.io/role/elb" = "1"
          + "public_subnet2"         = "ap-southeast-1b"
        }
      + tags_all                                       = {
          + "Name"                   = "thodung-vntechies-public_subnet2-ap-southeast-1b"
          + "component"              = "thodung"
          + "env"                    = "vntechies"
          + "github_repo"            = "github.com/vntechies/013-demo-gitops"
          + "group"                  = "public_subnet"
          + "kubernetes.io/role/elb" = "1"
          + "project"                = "013-demo-gitops"
          + "public_subnet2"         = "ap-southeast-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_subnet.this["public_subnet3"] will be created
+ resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "thodung-vntechies-public_subnet3-ap-southeast-1c"
          + "group"                  = "public_subnet"
          + "kubernetes.io/role/elb" = "1"
          + "public_subnet3"         = "ap-southeast-1c"
        }
      + tags_all                                       = {
          + "Name"                   = "thodung-vntechies-public_subnet3-ap-southeast-1c"
          + "component"              = "thodung"
          + "env"                    = "vntechies"
          + "github_repo"            = "github.com/vntechies/013-demo-gitops"
          + "group"                  = "public_subnet"
          + "kubernetes.io/role/elb" = "1"
          + "project"                = "013-demo-gitops"
          + "public_subnet3"         = "ap-southeast-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_vpc.vpc will be created
+ resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "thodung-vntechies-vpc-demo-vpc"
        }
      + tags_all                             = {
          + "Name"        = "thodung-vntechies-vpc-demo-vpc"
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
    }

  # module.vpc["demo-vpc"].aws_vpc_endpoint.dynamodb will be created
+ resource "aws_vpc_endpoint" "dynamodb" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-1.dynamodb"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "thodung-vntechies-s3-gwendpoint-ap-southeast-1"
        }
      + tags_all              = {
          + "Name"        = "thodung-vntechies-s3-gwendpoint-ap-southeast-1"
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_vpc_endpoint.s3 will be created
+ resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "thodung-vntechies-s3-gwendpoint-ap-southeast-1"
        }
      + tags_all              = {
          + "Name"        = "thodung-vntechies-s3-gwendpoint-ap-southeast-1"
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

Plan: 30 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ aws_iam_openid_connect_provider_arn = (known after apply)
+ eks_cluster_arn                     = (known after apply)
+ eks_cluster_endpoint                = (known after apply)
+ eks_cluster_id                      = (known after apply)
+ eks_cluster_name                    = "thodung-vntechies-eks-demo-eks"
+ subnet_ids                          = {
      + demo-vpc = {
          + public_subnet1 = (known after apply)
          + public_subnet2 = (known after apply)
          + public_subnet3 = (known after apply)
        }
    }
+ vpc_ids                             = {
      + demo-vpc = (known after apply)
    }
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p vntechies-gitops`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.hungran.cloud:4141/lock?id=vntechies%252F013-demo-gitops%252Fterraform%252Fap-southeast-1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p vntechies-gitops`
</details>
Plan: 30 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`